src/test/resources/filebody_unit_test/json_step_text_request.json

{
    "name": "create_emp",
    "url": "/api/test/v1/employess",
    "operation": "POST",
    "request": "I am a simple text",
//    "request": "<?xml version=\"1.0\" encoding=\"utf-8\"?>\n<soap:Envelope xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\" xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">\n  <soap:Body>\n    <ConversionRate xmlns=\"http://www.webserviceX.NET/\">\n      <FromCurrency>AFA</FromCurrency>\n      <ToCurrency>GBP</ToCurrency>\n    </ConversionRate>\n  </soap:Body>\n</soap:Envelope>",
    "assertions": {
        "status": 201,
        "body": {
            "id": 100
        }
    }
}